emacs2/config.org
#+TITLE: Emacs configuration.
#+DESCRIPTION: Emacs configuration is written in orgmode. Code is directly written to the files using org-babel-tangle without the need to start orgmode at startup.
#+PROPERTY: header-args:elisp :lexical t :tangle "init.el" :mkdirp "lisp"
#+STARTUP: showeverything

* Must Reads
1. [[https://discourse.doomemacs.org/t/common-config-anti-patterns/119][Common config anti-patters]]
2. [[https://discourse.doomemacs.org/t/common-errors-how-to-deal-with-them/58][Common errors & how to deal with them]]

* "My" tricks for <1s startup time (GUI Emacs on ~5 year old laptop):

Link:https://www.reddit.com/r/emacs/comments/lkfuk5/comment/gnk42ta/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button

 Defer most packages using ***use-package*** (most important)

 increase ***gc-cons-threshold*** during startup

 use ***early-init.el*** to set graphical parameters and fonts

 make sure scratch starts in fundamental-mode

 avoid ***set-face-attributes***

 avoid ***load-theme***

 avoid ***require*** during startup

 don't use ****:init** in use-package

 use ***esup*** to find things that slow down startup

 use ***package-quickstart***

 unset ***file-name-handler-alist*** during startup

* Xresources
#+begin_src sh :tangle "~/.Xresources"
Emacs.font: JetBrainsMono Nerd Font Mono:size=15

  Xft.autohint: 0
  Xft.lcdfilter: lcddefault
  Xft.hintstyle: hintslight
  Xft.hinting: 1
  Xft.antialias: 1 Xft.rgba: rgb
#+end_src

* Early-init
=Early-init= made for speed up Emacs.

#+BEGIN_SRC elisp :tangle "early-init.el"
;; early-init.el -*- lexical-binding: t; -*-
; https://github.com/hlissner/doom-emacs/blob/58af4aef56469f3f495129b4e7d947553f420fca/core/core.el#L200
  (unless (daemonp)
    (advice-add #'display-startup-echo-area-message :override #'ignore))

;; Disable "file-name-handler-alist" than enable it later for speed.
(defvar startup/file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq file-name-handler-alist startup/file-name-handler-alist)
            (makunbound 'startup/file-name-handler-alist)))

;; Speed up package loading 
(setq package-quickstart t)

;; Loads packages only when needed
(setq use-package-always-defer t)
#+END_SRC

** Disable menu and scrollbar
#+BEGIN_SRC elisp :tangle "early-init.el"
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (tooltip-mode -1)
  (scroll-bar-mode -1)
  (horizontal-scroll-bar-mode -1)
  (global-tab-line-mode -1) ; tab line
  (tab-bar-mode -1) ; tabs
  (global-visual-line-mode t) ; don't let the text to go horizontal.
  (global-hl-line-mode t) ; highlight the line you're on.
  (global-display-line-numbers-mode t) ; global display line numbers.
  (electric-pair-mode t) ;; auto brackets.
  (electric-indent-mode -1)
#+END_SRC

** Fringe
#+begin_src elisp :tangle "early-init.el"
  (set-fringe-mode 0)
#+end_src

** Remeber last place you were in file.
#+BEGIN_SRC elisp :tangle "early-init.el"
  (save-place-mode 1)
#+END_SRC

** Auto revert buffer for changed files.
#+BEGIN_SRC elisp :tangle "early-init.el"
  (global-auto-revert-mode t)
#+END_SRC

** Auto revert dired buffer
#+BEGIN_SRC elisp :tangle "early-init.el"
  (setq global-auto-revert-non-file-buffers t)
#+END_SRC

** Open Emacs in full screen always.
#+BEGIN_SRC elisp :tangle "early-init.el"
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+END_SRC

** Preventing flickering.
#+begin_src elisp :tangle "early-init.el"
  (add-to-list 'default-frame-alist '(inhibit-double-buffering . t))
#+end_src

** Show parenthesis.
#+BEGIN_SRC elisp :tangle "early-init.el"
 (setq show-paren-style 'expression)
 (show-paren-mode 1)
 (set-face-background 'show-paren-match (face-background 'default))
 (set-face-foreground 'show-paren-match "#def")
 (custom-set-faces
  '(show-paren-match ((t (:weight extra-bold)))))
#+END_SRC

** Reduce fanfare
#+BEGIN_SRC elisp :tangle "early-init.el"
  ;; TODO See https://yrh.dev/blog/rant-obfuscation-in-emacs/
  (setq inhibit-startup-echo-area-message "angrybacon")
#+END_SRC

#+BEGIN_SRC elisp :tangle "early-init.el"
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

;;  (setq gc-cons-threshold (expt 2 32)) ; you can remove it
   (setq gc-cons-threshold (* 8 1024 1024))
#+END_SRC

** Garbage collection
#+BEGIN_SRC elisp :tangle "early-init.el"
  ;; Defer garbage collection further back in the startup process
  (setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
	gc-cons-percentage 0.6)

  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (setq gc-cons-threshold 16777216 ; 16mb
		    gc-cons-percentage 0.1)))

  (setq safe-local-variable-values
	'((org-src-preserve-indentation . t)
	  (eval add-hook 'after-save-hook
		'(lambda nil
		   (org-babel-tangle))
		nil t)))
#+END_SRC

#+BEGIN_SRC elisp :tangle "early-init.el"
  (setq
   package-enable-at-startup nil ; don't auto-initialize!
   package-enable-imenu-support t
   package--init-file-ensured t ; don't add that `custom-set-variables' block to init
   package-archives nil
   load-prefer-newer t ; prefer newer package files.
   frame-resize-pixelwise t
   visible-bell 1 ; Alarm bell (flash the bar)

   ;; Tab behaviour
   completion-cycle-threshold 3 ;; TAB cycle if there are only few candidates
   tab-always-indent 'complete ;; Enable indentation+completion using the TAB key.
   tab-line-new-button-show nil
   echo-keystrokes 0.01 ;; decrease the echoing of the keystrokes.

   ;; Tab line
   tab-line-close-button-show nil
   tab-line-separator " "
   line-move-visual nil
   site-run-file nil ; unset SRF
   pixel-scroll-precision-mode t
   pixel-scroll-precision-use-momentum t
   scroll-conservatively 101 ;; scroll line by line.
   use-file-dialog nil
   mode-line-format nil ; don't want a mode line while loading init
   create-lockfiles nil ; disable lockfiles
   make-backup-files nil ; disable backup file
   backup-directory-alist '((".*" . "~/.local/share/Trash/files"))
   auto-save-list-file-prefix nil ; disable auto-save
   auto-save-default nil
   auto-save-mode nil
   delete-auto-save-files t ; delete auto save files
   auto-mode-case-fold nil ; use case-sensitive `auto-mode-alist' for performance
   default-input-method nil
   utf-translate-cjk-mode nil ; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
   initial-scratch-message nil ; empty the initial *scratch* buffer.
   message-log-max nil
   command-line-x-option-alist nil ; remove irreleant command line options for faster startup
   use-short-answers t ; y/n for yes/no
   vc-follow-symlinks t ; Do not ask about symlink following
   use-dialog-box nil
   inhibit-default-init t
   use-file-dialog nil
   redisplay-dont-pause t ; improve display engine
   inhibit-splash-screen t
   inhibit-startup-screen t		; do not show the startup message
   inhibit-startup-message t      ; reduce noise at startup
   inhibit-startup-buffer-menu t  ; stop `list-buffers' from showing when opening multiple files
   fast-but-imprecise-scrolling t ; more performant rapid scrolling over unfontified regions
   frame-inhibit-implied-resize t ; do not resize the frame at this early stage
   ffap-machine-p-known 'reject   ; don't ping things that look like domain names
   inhibit-compacting-font-caches t ; Inhibit frame resizing for performance
   read-process-output-max (* 1024 1024) ; Increase how much is read from processes in a single chunk.
   redisplay-skip-fontification-on-input t ; Inhibits it for better scrolling performance.
   idle-update-delay 1.0 ; slow down UI updates down
   select-active-regions 'only ; Emacs hangs when large selections contain mixed line endings
   ad-redefinition-action 'accept ; disable warnings from legacy advice system
   initial-major-mode 'fundamental-mode
   inhibit-startup-echo-area-message (user-login-name)
   auto-save-default t ;; autosave
   confirm-kill-emacs 'y-or-n-p ; confirm before exiting emacs
   enable-local-variables :safe ; host security
   column-number-mode t
   global-display-line-number-mode 1
   display-line-numbers-type 'relative)

  ;; Prevent unwanted runtime builds; packages are compiled ahead-of-time when
  ;; they are installed and site files are compiled when gccemacs is installed.
  ;; (setq comp-deferred-compilation nil)
  (setq native-comp-jit-compilation t)
  ;; Suppress warnings and errors during asynchronous native compilation

  (setq native-comp-async-report-warnings-errors nil)

  ;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
  ;; compiled ahead-of-time when they are installed and site files are compiled
  ;; when gccemacs is installed.
  (setq comp-deferred-compilation nil)

  ;; Compile all sites-lisp on demand.
  (setq native-comp-deferred-compilation t)

  ;; Keep the eln cache clean.
  (setq native-compile-prune-cache t)

  (defalias 'yes-or-no-p 'y-or-n-p) ; yes or no to y or n
  (add-hook 'prog-mode-hook 'display-line-numbers-mode) ; Only use line-numbers in major modes
  (add-hook 'text-mode-hook 'display-line-numbers-mode)
  (setq select-enable-clipboard t) ;; Copy and Paste outside of Emacs
  (windmove-default-keybindings)

  ;; Solve slow icon rendering
  (setq inhibit-compacting-font-caches t)

  ;; Enable ibuffer
  (setq ibuffer-expert t)

  (setq display-buffer-alist nil)

  ;; Improve memory
  (setq-default history-length 1000)
  (setq-default prescient-history-length 1000)

  (setq gc-cons-threshold most-positive-fixnum)
#+END_SRC

** Making native compilation silent.
#+BEGIN_SRC elisp :tangle "early-init.el"
  (when (native-comp-available-p)
    (setq native-comp-prune-cache t))

  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name "var/eln-cache/" user-emacs-directory))))
#+END_SRC

** Clean up
#+BEGIN_SRC elisp :tangle "early-init.el"
  (setq backup-directory-alist    '(("." . "~/.local/share/Trash/files"))
	tramp-backup-directory-alist   backup-directory-alist
	temporary-directory    '(("." . "~/.local/share/Trash/files"))
	undo-tree-directory    '(("." . "~/.local/share/Trash/files"))
	vc-make-backup-files t ;; Use version control for backups
	version-control t     ;; Use version numbers for backups.
	kept-new-versions 10 ;; Number of newest versions to keep.
	kept-old-versions 5 ;; Number of oldest versions to keep.
	delete-old-versions t ;; Don't ask to delete excess backup versions.
	backup-by-copying t) ;; Copy all files, don't rename them.
#+END_SRC

** Fonts
#+BEGIN_SRC elisp :tangle "early-init.el"
  (custom-set-faces
;;   '(default ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant normal)))) ;; Impact startup time, Xresources will handle the default font.
   '(fixed-pitch ((t (:font "JetBrainsMono NFM" :weight medium :height 90 :slant normal))))
   '(variable-pitch ((t (:font "UbuntuMono Nerd Font" :weight medium :height 110 :slant normal))))
   '(font-lock-comment-face ((t (:font "JetBrainsMono NFM" :height 100 :weight medium :slant italic))))
   '(mode-line ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant normal))))
   '(mode-line-active ((t (:font "JetBrainsMono NFM" :weight bold :height 100 :slant normal))))
   '(mode-line-inactive ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant italic))))
   '(centaur-tabs-default ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant normal))))
   '(centaur-tabs-selected ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant normal))))
   '(centaur-tabs-unselected ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant italic))))
   '(org-link ((t (:font "JetBrainsMono NFM" :weight medium :height 100 :slant italic)))))
#+END_SRC

** Add frame borders and window dividers
#+BEGIN_SRC elisp :tangle "early-init.el"

(modify-all-frames-parameters
 '((right-divider-width . 10)
   (internal-border-width . 10)))
(dolist (face '(window-divider
                window-divider-first-pixel
                window-divider-last-pixel))
  (face-spec-reset-face face)
  (set-face-foreground face (face-attribute 'default :background)))
(set-face-background 'fringe (face-attribute 'default :background))
#+END_SRC 

* Init

** Load theme
#+BEGIN_SRC elisp
(load-theme 'modus-vivendi t)

;; Global tab width and use spaces
(setq-default tab-width 4)
(setq-default indent-tabs-mode nil)

;; Language-specific tweaks
(setq python-indent-offset 4)
(setq c-basic-offset 4)
(setq js-indent-level 4)
(add-hook 'sh-mode-hook (lambda ()
  (setq sh-basic-offset 4 sh-indentation 4)))

#+END_SRC

** Maximum native eln speed.
Look for native-compile-async using variable "C-h v =native-comp-eln-load-path="
#+BEGIN_SRC elisp
  ;; init.el -*- lexical-binding: t; -*-
  (setq native-comp-speed 3)

  (native-compile-async "/usr/lib/emacs/30.1/native-lisp" 'recursively)
  (setq native-comp-compiler-options '("-march=znver3" "-Ofast" "-g0" "-fno-finite-math-only" "-fgraphite-identity" "-floop-nest-optimize" "-fdevirtualize-at-ltrans" "-fipa-pta" "-fno-semantic-interposition" "-flto=auto" "-fuse-linker-plugin"))

  (setq native-comp-driver-options '("-march=znver3" "-Ofast" "-g0" "-fno-finite-math-only" "-fgraphite-identity" "-floop-nest-optimize" "-fdevirtualize-at-ltrans" "-fipa-pta" "-fno-semantic-interposition" "-flto=auto" "-fuse-linker-plugin"))
#+END_SRC

** Autoload
#+begin_src elisp
  (add-to-list 'load-path (expand-file-name "lisp/" user-emacs-directory))
  
  (autoload 'infu-bionic-reading-buffer "bionic-reading.el" t)
  (autoload 'gdb "gdb.el" t)
  (autoload 'my/protect-vital-buffers "feature.el" t)
  (autoload 'my/toggle-mode-line "feature.el" t)
  (autoload 'my/visit-init "feature.el" t)
  (autoload 'my/visit-qtile "feature.el" t)
  (autoload 'my/highlight-word "feature.el" t)
  (autoload 'my/kill-all-buffers "feature.el" t)
  (autoload 'my/split-and-follow-horizontally "feature.el" t)
  (autoload 'my/split-and-follow-vertically "feature.el" t)
  (autoload 'my/kill-whole-word "feature.el" t)
  (autoload 'my/copy-whole-line "feature.el" t)
#+end_src

** Colors
#+BEGIN_SRC elisp
  (custom-set-faces
  ;;  '(default ((t (:background "black")))) ;; background color (controlled by =doom theme=)
    '(fringe ((t (:background "white"))))
    '(mode-line-inactive ((t (:background "nil"))))) ;; Dim inactive modeline.

  (add-hook 'neotree-mode-hook (lambda ()
      (setq buffer-face-mode-face `(:background "#211C1C"))
      (buffer-face-mode 1)))

  (add-hook 'vterm-mode-hook (lambda ()
      (setq buffer-face-mode-face `(:background "#211C1C"))
      (buffer-face-mode 1)))
#+END_SRC

* Use package

** Use-package.el is no longer needed at runtime.
https://github.com/jwiegley/use-package?tab=readme-ov-file#use-packageel-is-no-longer-needed-at-runtime
#+BEGIN_SRC elisp
    (eval-when-compile
      (require 'use-package))
#+END_SRC

** Use-package repo's
#+BEGIN_SRC elisp
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+END_SRC

** Native compile external packages
#+BEGIN_SRC elisp
  (setq-default
   package-native-compile t
   use-package-always-ensure t
   use-package-enable-imenu-support t)
#+END_SRC

