emacs2/config.org
* Programming languages
#+BEGIN_SRC elisp
(use-package python            ;; Python-specific tweaks
  :ensure nil
  :hook (python-mode . lsp)
  :config (setq python-indent-offset 4))

(use-package cc-mode           ;; C/C++ tweaks
  :ensure nil
  :hook (c-mode-common . lsp)
  :config (setq c-basic-offset 4))

(use-package js                ;; JS tweaks
  :ensure nil
  :hook (js-mode . lsp)
  :config (setq js-indent-level 2))

(use-package sh-script         ;; Shell scripts
  :ensure nil
  :config
  (add-hook 'sh-mode-hook (lambda ()
                            (setq sh-basic-offset 4 sh-indentation 4))))

(use-package lua-mode
    :ensure t
    :mode ("%LUA" . lua-mode)
    :config
    (setq lua-indent-string-contents t)
    (setq lua-indent-close-paren-align t))
 
 (use-package asm-mode
  :ensure t
  :mode ("\\.\\(asm\\|s\\|S\\)$" . asm-mode)
  :hook (asm-mode . (lambda ()
                      ;; your asm-mode customizations here
                      ))
  :config
  ;; extra configuration for asm-mode (does NOT activate it everywhere)
)
#+END_SRC

* Bionic Reading
#+BEGIN_SRC elisp :tangle "lisp/bionic-reading.el"
  (defvar infu-bionic-reading-face nil "a face for `infu-bionic-reading-region'.")

  (setq infu-bionic-reading-face 'bold)
  ;; try
  ;; 'bold
  ;; 'error
  ;; 'warning
  ;; 'highlight
  ;; or any value of M-x list-faces-display

  (defun infu-bionic-reading-buffer ()
    "Bold the first few chars of every word in current buffer.
  Version 2022-05-21"
    (interactive)
    (infu-bionic-reading-region (point-min) (point-max)))

  (defun infu-bionic-reading-region (Begin End)
    "Bold the first few chars of every word in region.
  Version 2022-05-21"
    (interactive "r")
    (let (xBounds xWordBegin xWordEnd  )
      (save-restriction
	(narrow-to-region Begin End)
	(goto-char (point-min))
	(while (forward-word)
	  ;; bold the first half of the word to the left of cursor
	  (setq xBounds (bounds-of-thing-at-point 'word))
	  (setq xWordBegin (car xBounds))
	  (setq xWordEnd (cdr xBounds))
	  (setq xBoldEndPos (+ xWordBegin (1+ (/ (- xWordEnd xWordBegin) 2))))
	  (put-text-property xWordBegin xBoldEndPos
			     'font-lock-face infu-bionic-reading-face)))))

  (provide 'bionic-reading)
#+END_SRC

* GDB
#+BEGIN_SRC elisp :tangle "lisp/gdb.el"
  (setq gdb-many-windows nil)

  (defun set-gdb-layout(&optional c-buffer)
    (if (not c-buffer)
	(setq c-buffer (window-buffer (selected-window)))) ;; save current buffer

    ;; from http://stackoverflow.com/q/39762833/846686
    (set-window-dedicated-p (selected-window) nil) ;; unset dedicate state if needed
    (switch-to-buffer gud-comint-buffer)
    (delete-other-windows) ;; clean all

    (let* (
	   (w-source (selected-window)) ;; left top
	   (w-gdb (split-window w-source nil 'right)) ;; right bottom
	   (w-locals (split-window w-gdb nil 'above)) ;; right middle bottom
	   (w-stack (split-window w-locals nil 'above)) ;; right middle top
	   (w-breakpoints (split-window w-stack nil 'above)) ;; right top
	   (w-io (split-window w-source (floor(* 0.9 (window-body-height)))
			       'below)) ;; left bottom
	   )
      (set-window-buffer w-io (gdb-get-buffer-create 'gdb-inferior-io))
      (set-window-dedicated-p w-io t)
      (set-window-buffer w-breakpoints (gdb-get-buffer-create 'gdb-breakpoints-buffer))
      (set-window-dedicated-p w-breakpoints t)
      (set-window-buffer w-locals (gdb-get-buffer-create 'gdb-locals-buffer))
      (set-window-dedicated-p w-locals t)
      (set-window-buffer w-stack (gdb-get-buffer-create 'gdb-stack-buffer))
      (set-window-dedicated-p w-stack t)

      (set-window-buffer w-gdb gud-comint-buffer)

      (select-window w-source)
      (set-window-buffer w-source c-buffer)
      ))
  (defadvice gdb (around args activate)
    "Change the way to gdb works."
    (setq global-config-editing (current-window-configuration)) ;; to restore: (set-window-configuration c-editing)
    (let (
	  (c-buffer (window-buffer (selected-window))) ;; save current buffer
	  )
      ad-do-it
      (set-gdb-layout c-buffer))
    )
  (defadvice gdb-reset (around args activate)
    "Change the way to gdb exit."
    ad-do-it
    (set-window-configuration global-config-editing))

  (provide 'gdb)
#+END_SRC

* Features

** Don't let the specified get killed.
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/protect-vital-buffers ()
    "Prevent killing vital buffers."
    (not (member (buffer-name) '("*Welcome-screen*"))))
  (message "I'm Immortal")
  (add-hook 'kill-buffer-query-functions #'my/protect-vital-buffers)
#+END_SRC

** Toggle modeline
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
   (defun my/toggle-mode-line ()
  "Toggles the modeline on and off."
    (interactive) 
    (setq mode-line-format
      (if (equal mode-line-format nil)
	  (default-value 'mode-line-format)) )
    (redraw-display))
  (global-set-key [M-f12] 'toggle-mode-line) 
#+end_src

** Visit the config.
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/visit-init ()
    "Open the Emacs init file."
    (interactive)
    (message "Opening Emacs Init")
    (find-file (expand-file-name "config.org" user-emacs-directory)))
#+END_SRC

** Visit the qtile config.
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/visit-qtile ()
    "Open the qtile cofnig file."
    (interactive)
    (message "Opening Qtile Configuration")
    (find-file "~/.config/qtile/config.py"))
#+END_SRC

** Highlight the word.
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/highlight-word ()
    "Highlight the current word you are on."
    (interactive)
    (message "Highlighting word")
    (backward-word 1)
    (set-mark-command nil)
    (forward-word 1))
#+END_SRC

** Close all buffers
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/kill-all-buffers ()
    "Kill all the buffers."
    (interactive)
    (message "Killed all buffers")
    (mapc 'kill-buffer (buffer-list)))
#+end_src

** Switch cursor automatically to new window.
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/split-and-follow-horizontally ()
    "Split horziontally and follow."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun my/split-and-follow-vertically ()
    "Split vertically and follow."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
#+END_SRC

** Kill the whole word
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/kill-whole-word ()
    "kill the whole word."
    (interactive)
    (message "Killed whole word")
    (backward-word)
    (kill-word 1))
#+END_SRC

** Copy the whole line
#+BEGIN_SRC elisp :tangle "lisp/feature.el"
  (defun my/copy-whole-line ()
    "Copy whole line."
    (interactive)
    (message "Copied whole line")
    (save-excursion
      (kill-new
       (buffer-substring
	(pos-bol)
	(pos-eol)))))
#+END_SRC

** Keep this at the bottom of the feature file.
#+begin_src elsip :tangle "lisp/feature.el"
  (provide 'feature)
#+end_src
